{
    "076e0546": {
        "confession": "I once accidentally liked a very old picture while stalking someone on social media. I quickly unliked it, but I'm pretty sure they got the notification",
        "date": "October 31, 2023",
        "time_gmt": "15:56:18",
        "author": "AnonymousUser#4786"
    },
    "d29a5f85": {
        "confession": "I secretly enjoy watching cheesy romantic comedies, even though I pretend to dislike them in front of my friends.",
        "date": "October 31, 2023",
        "time_gmt": "15:59:41",
        "author": "AnonymousUser#4099"
    },
    "b34a47f6": {
        "confession": "I once pretended to be sick for a week to avoid going to a family gathering because I was too embarrassed to admit I had forgotten my cousin's name.",
        "date": "October 31, 2023",
        "time_gmt": "17:44:54",
        "author": "AnonymousUser#8303"
    },
    "fe257792": {
        "confession": "I once accidentally sent a love letter meant for my crush to my boss. It was incredibly embarrassing, but we both pretended it never happened",
        "date": "October 31, 2023",
        "time_gmt": "17:57:47",
        "author": "AnonymousUser#5222"
    },
    "cdc188e6": {
        "confession": "I used to steal cookies from the cookie jar as a child and blamed it on my younger sibling every time. They got punished for my sweet tooth.",
        "date": "October 31, 2023",
        "time_gmt": "18:50:09",
        "author": "AnonymousUser#5314"
    },
    "0c0bc5ae": {
        "confession": "I once broke my neighbor's window with a baseball and never confessed. They still think it was a stray ball, and I never owned up to my mistake.",
        "date": "October 31, 2023",
        "time_gmt": "18:51:00",
        "author": "AnonymousUser#9892"
    },
    "58d0492f": {
        "confession": "I lied about my age on a dating app and ended up going on a date with someone who thought I was older. I felt guilty the entire time and never saw them again",
        "date": "October 31, 2023",
        "time_gmt": "18:54:26",
        "author": "AnonymousUser#6181"
    },
    "e9dcac06": {
        "confession": "I pretended to have read a classic novel in high school to impress my English teacher. I managed to pull it off, but I still haven't read the book.",
        "date": "October 31, 2023",
        "time_gmt": "18:56:43",
        "author": "AnonymousUser#1978"
    },
    "b0c0ed4a": {
        "confession": "I once ate my roommate's leftovers, and when they asked about it, I acted genuinely surprised, as if someone else in the house must have taken it.",
        "date": "October 31, 2023",
        "time_gmt": "18:56:56",
        "author": "AnonymousUser#3232"
    },
    "2c3f51bc": {
        "confession": "I have a secret stash of junk food that I hide from my significant other. Whenever they ask if I've been snacking, I deny it, but I indulge when they're not around.",
        "date": "October 31, 2023",
        "time_gmt": "18:57:28",
        "author": "AnonymousUser#2749"
    },
    "621ee032": {
        "confession": "I would like to confess that once I accidentally ate chicken being a pure vegetarian 🥲",
        "date": "October 31, 2023",
        "time_gmt": "19:48:20",
        "author": "AnonymousUser#7650"
    },
    "8e3809bb": {
        "confession": "I would like to confess that once I broke my aunt's flower pot and accused my cousin of it 😜",
        "date": "November 01, 2023",
        "time_gmt": "12:58:20",
        "author": "AnonymousUser#1642"
    }
}